Revit 2024 API
FlexPipe.FlexPipeType Property
 The flex pipe type of this flex pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FlexPipeType FlexPipeType { get; set; }
Visual Basic
Public Property FlexPipeType As FlexPipeType
	Get
	Set
Visual C++
public:
property FlexPipeType^ FlexPipeType {
	FlexPipeType^ get ();
	void set (FlexPipeType^ value);
}
See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace